In [21]:
#import pandas
import pandas as pd
#import numpy just in case
import numpy as np

#reading csv file in padas in dataframe
df = pd.DataFrame(pd.read_csv('C://Users//danie//Documents//IS362Project1Data.csv', header=0))
df

,Unnamed: 0,Unnamed: 1,Los Angeles,Phoenix,San Diego,San Francisco,Seattle
0,ALASKA,on time,497.0,221.0,212.0,503.0,1841.0
1,NaN,delayed,62.0,12.0,20.0,102.0,305.0
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AM WEST,on time,694.0,4840.0,383.0,320.0,201.0
4,NaN,delayed,117.0,415.0,65.0,129.0,61.0

In [22]:
#experimenting with first getting the specific values from the arrival delays 
ALASKA_delayed = df.values[1]
AMWEST_delayed = df.values[4]
print ALASKA_delayed, AMWEST_delayed
#it prints them out side by side, however, when comparing them, it's rather difficult and uncomfortable this way...

[nan 'delayed' 62.0 12.0 20.0 102.0 305.0] [nan 'delayed' 117.0 415.0 65.0 129.0 61.0]

In [23]:
#experimenting with location of rows
df.iloc[1], df.iloc[4]
#this time it prints them out in a stack, its easier to read than the previous one but it's still rather uncomfortable...

(Unnamed: 0           NaN
 Unnamed: 1       delayed
 Los Angeles           62
 Phoenix               12
 San Diego             20
 San Francisco        102
 Seattle              305
 Name: 1, dtype: object, Unnamed: 0           NaN
 Unnamed: 1       delayed
 Los Angeles          117
 Phoenix              415
 San Diego             65
 San Francisco        129
 Seattle               61
 Name: 4, dtype: object)

In [42]:
#experimented with dropping rows since the NaN row was irritating me, thought it would be useful to also drop rows 
#that weren't going to be used
dfc = df.copy()
ss = dfc.drop([0, 2, 3])
#removing unnecessary row by using the pop method
ss.pop('Unnamed: 0')
ss

  Unnamed: 1  Los Angeles  Phoenix  San Diego  San Francisco  Seattle
1    delayed         62.0     12.0       20.0          102.0    305.0
4    delayed        117.0    415.0       65.0          129.0     61.0

In [46]:
#renamed column and rows for better overall comparison purposes
ss.rename(index={1:'ALASKA', 4:'AM WEST'}, columns={'Unnamed: 1' : 'Arrival Type'})

        Arrival Type  Los Angeles  Phoenix  San Diego  San Francisco  Seattle
ALASKA       delayed         62.0     12.0       20.0          102.0    305.0
AM WEST      delayed        117.0    415.0       65.0          129.0     61.0

In [131]:
ss.max()
#AM West had the max arrival delay time for los angeles, phoenix, san diego, and san fransisco. Alaska had the most for Seattle.

Unnamed: 1       delayed
Los Angeles          117
Phoenix              415
San Diego             65
San Francisco        129
Seattle              305
dtype: object

In [126]:
ss.min()
#alaska had the least arrival delay time for los angeles, phoenix, san diego, and san fransisco. 
#AM West had the least for Seattle.

Unnamed: 1       delayed
Los Angeles           62
Phoenix               12
San Diego             20
San Francisco        102
Seattle               61
dtype: object

In [110]:
#experimenting with switching columns with rows
trans_ss = ss.transpose()
#rename
trans_ss.rename(columns={1:'ALASKA', 4:'AM WEST'}, index={'Unnamed: 1' : 'Arrival Type'})

                ALASKA  AM WEST
Arrival Type   delayed  delayed
Los Angeles         62      117
Phoenix             12      415
San Diego           20       65
San Francisco      102      129
Seattle            305       61

In [143]:
trans_ss.describe()
#alaska's top arrival delays were 20, AM West's were 415. Alaska's top number is significantly lower than AM West's.
#there are 6 unique values

           1      4
count    6.0    6.0
unique   6.0    6.0
top     20.0  415.0
freq     1.0    1.0

In [139]:
trans_ss[1].min()
#alaska's least number of arrival delays were 12
trans_ss[1].count()

6

In [137]:
trans_ss[4].min()
#am west's least number of arrival delays were 61

61.0

In [ ]:
#My conclusions are that the airline with the least amount of arrival delyas is Alaska, 
#the one with the most amount of arrival delays was AM West.
#The only time Alaska had the most amount of arrival delays was in Seattle, everywhere else AM West had the most.